DATE_WRONG_INPUT_MESSAGE = 'Неверный ввод. Введите дату в формате YYYY-MM-DD. Попробуйте еще раз.'

PRIORITY_WRONG_INPUT_MESSAGE = 'Неверный ввод. Введите число от 1 до 3 включительно. Попробуйте еще раз.'

FEATURE_EMPTY_MESSAGE = 'Неверный ввод. Поле "{}" не может быть пустым. Попробуйте еще раз.'

ERROR_EMPTY_MESSAGE = "Неверный ввод. Поле не может быть пустым. Попробуйте еще раз."

ADD_TASK_MESSAGES = {
    'title': 'Введите название: ',
    'description': 'Введите описание: ',
    'category': 'Введите категорию: ',
    'due_date': 'Введите срок выполнения в формате YYYY-MM-DD: ',
    'priority': 'Введите приоритет от 1 до 3, где 3 - низкий, 1 - высокий: '
}

VIEW_TASK_MESSAGE = '''Задача #{}:
Название: {}
Описание: {}
Категория: {}
Дедлайн: {}
Приоритет: {}
Статус: {}'''

EDIT_TASK_MESSAGE = 'Введите номер задачи, которую хотите изменить: '

EDIT_TASK_ERROR_MESSAGE = 'Введен номер несуществующей задачи. Пожалуйста, попробуйте еще раз.'

MAIN_MENU_MESSAGE = """Менеджер задач
1. Просмотр задач
2. Добавить новую задачу
3. Изменить задачу
4. Удалить задачу
5. Поиск задач
6. Выход"""

MENU_WRONG_INPUT_MESSAGE = "Неправильный ввод. Пожалуйста, попробуйте еще раз."

MENU_PROCEED_MESSAGE = 'Нажмите Enter, чтобы продолжить'

EDIT_TASK_CHOICE_MESSAGE = """Выберите, что вы хотите изменить:
1. Отметить задачу выполненной
2. Изменить задачу целиком"""

EDIT_TASK_WRONG_CHOICE_MESSAGE = "Неправильный ввод. Пожалуйста, введите 1 или 2."

EDIT_COMPLETED_TASK_ERROR_MESSAGE = "Отметить выполненной можно только задачу, которая еще не выполнена. Пожалуйста, попробуйте еще раз."

TASK_COMPLETION_MESSAGE = "Задача #{} отмечена выполненной."